app/controllers/application_controller.rb

    def fetch_user
      # Search for a user by their user id if we can find one in the session hash.
      if session[:user_id].present?
        @current_user = User.find_by :id => session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]