app/controllers/msgr_controller.rb

INSERT INTO "chatroom_messages" ("user_id", "chatroom_id", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["chatroom_id", 1], ["message", "oyoo"], ["created_at", "2019-10-29 07:15:07.382741"], ["updated_at", "2019-10-29 07:15:07.382741"]]
---
    def chatroom_newmessage
        @logged_in_user = User.find_by :id => session[:user_id]
        message = ChatroomMessage.new
        message.user_id = @logged_in_user.id
        message.chatroom_id = params[:id]
        message.message = params[:message]
        message.save