app/controllers/msgr_controller.rb

SELECT "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def chatroom
        @roomid = params[:id]
        @messages = ChatroomMessage.where(chatroom_id: @roomid)
        @chatroom_users = ChatroomUser.where(chatroom_id: @roomid)
        @chatroom = Chatroom.find_by :id => @roomid