app/controllers/msgr_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def login
        @logged_in_user = User.find_by :id => session[:user_id]

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def splash
        @logged_in_user = User.find_by :id => session[:user_id]

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def profile
        @logged_in_user = User.find_by :id => session[:user_id]

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "displayname" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["displayname", "Sean"], ["updated_at", "2019-10-29 07:21:15.200510"], ["id", 1]]
---
    def profile_update
        profile = User.find_by :id => session[:user_id]
        profile.username = params[:edit_username]
        profile.displayname = params[:edit_displayname]
        profile.age = params[:edit_age]
        profile.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def profile_edit
        @logged_in_user = User.find_by :id => session[:user_id]

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def friends_list
        @logged_in_user = User.find_by :id => session[:user_id]

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "login1"], ["LIMIT", 1]]
INSERT INTO "user_friends" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["friend_id", 1], ["created_at", "2019-10-29 09:26:21.797689"], ["updated_at", "2019-10-29 09:26:21.797689"]]
---
    def friends_list_add_friend
        friend = User.find_by :username => params[:add_friend_username]
        new_friend = UserFriend.new
        new_friend.user_id = session[:user_id]
        new_friend.friend_id = friend.id
        new_friend.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "chatroom_users".* FROM "chatroom_users" WHERE "chatroom_users"."user_id" = $1  [["user_id", 1]]
---
    def chatrooms_list
        @logged_in_user = User.find_by :id => session[:user_id]
        @chatrooms = ChatroomUser.where(user_id: @logged_in_user)

SELECT "chatroom_messages".* FROM "chatroom_messages" WHERE "chatroom_messages"."chatroom_id" = $1  [["chatroom_id", 1]]
SELECT "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def chatroom
        @roomid = params[:id]
        @messages = ChatroomMessage.where(chatroom_id: @roomid)
        @chatroom_users = ChatroomUser.where(chatroom_id: @roomid)
        @chatroom = Chatroom.find_by :id => @roomid

SELECT "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "chatrooms" SET "room_name" = $1, "updated_at" = $2 WHERE "chatrooms"."id" = $3  [["room_name", nil], ["updated_at", "2019-10-29 08:41:01.255110"], ["id", 1]]
---
    def chatroom_update
        chatroom = Chatroom.find_by :id => params[:id]
        chatroom.room_name = params[:update_room_name]
        chatroom.save

SELECT "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test"], ["LIMIT", 1]]
INSERT INTO "chatroom_users" ("user_id", "chatroom_id", "is_admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["chatroom_id", 1], ["is_admin", false], ["created_at", "2019-10-29 08:52:58.027671"], ["updated_at", "2019-10-29 08:52:58.027671"]]
---
    def chatroom_add_member
        chatroom = Chatroom.find_by :id => params[:id]
        member = User.find_by :username => params[:add_member_username]
        new_member = ChatroomUser.new
        new_member.user_id = member.id
        new_member.chatroom_id = params[:id]
        new_member.is_admin = false
        new_member.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "chatroom_messages" ("user_id", "chatroom_id", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["chatroom_id", 1], ["message", "another"], ["created_at", "2019-10-29 08:53:25.561020"], ["updated_at", "2019-10-29 08:53:25.561020"]]
---
    def chatroom_newmessage
        @logged_in_user = User.find_by :id => session[:user_id]
        message = ChatroomMessage.new
        message.user_id = @logged_in_user.id
        message.chatroom_id = params[:id]
        message.message = params[:message]
        message.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "chatroom_users".* FROM "chatroom_users" WHERE "chatroom_users"."user_id" = $1 AND "chatroom_users"."chatroom_id" = $2  [["user_id", 1], ["chatroom_id", 1]]
DELETE FROM "chatroom_users" WHERE "chatroom_users"."id" = $1  [["id", 1]]
---
    def chatroom_leave
        @chatroom = params[:id]
        chatroom_users = ChatroomUser.where({user_id: session[:user_id], chatroom_id: @chatroom })
        chatroom_users.each{|link| link.destroy}