app/controllers/session_controller.rb

    def create
        # This is the action to which the login form post request is posted. It will add the
        #user's id to the session hash, which will be used for authentication and
        #authorization throughout the session.
        user = User.find_by :username => params[:username]
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "admin_username"], ["LIMIT", 1]]